Documentation/Source/Bio_Editing.org
#+TITLE: Bios Editing in Zambia
#+EMAIL: NELA.Percy@gmail.com
#+AUTHOR: Percy
#+DATE: November 2011
#+DESCRIPTION: Zambia is a piece of Conference Management Software.  This document is a "How To" guide to editing the various bios type entries for the Zambia FFF-branch instance for your conference.  This is still a work in progress.
#+MACRO: DESCRIPTION Zambia is a piece of Conference Management Software.  This document is a "How To" guide to editing the various bios type entries for the Zambia FFF-branch instance for your conference.  This is still a work in progress.
#+KEYWORDS: Zambia, Documentation, FFF branch
#+META: KEYWORDS Zambia, Documentation, FFF branch
#+META: Silly This is just silly
#+LANGUAGE: en
#+OPTIONS: \n:nil ^:nil timestamp:nil creator:nil H:3 num:3 toc:nil @:t ::nil |:t -:t todo:nil tasks:nil tags:nil <:t *:t author:t email:t skip:nil d:t f:t pri:t
#+STARTUP: fninline
#+SETUPFILE: "Headers/setupfile.org"
#+INCLUDE: "Headers/include.org"
#+TOC: headlines 3
#+LaTeX: \listoftables
#+LaTeX: \newpage
#+LaTeX: \pagenumbering{arabic}
* Introduction

  The biographical information for your presenters is an important
  part of the convention experience that Zambia manages.  This is part
  of how people decide they want to attend your convention and part of
  what they might want to do when there.  From a presenter's point of
  view, the biographical information is a way to connect with their
  fan-base, to allow contact, give information, or arrange for
  continued interactions.  From a con manager's point of view,
  managing biographical information is fairly work-intensive, and one
  of the things that doesn't exactly scale.

  There are several pieces that make up the biographical information
  matrix within Zambia.  Few, any, or all of the elements can be
  chosen to be deployed and customized to the desire of your
  particular convention or set of conventions.  Currently the
  biographical information is designed to be held in a shared
  database, which lies outside of a specific convention, so that,
  while the information is available and editable within that
  convention, when the information is updated, it is updated across
  all the conventions served from the same server.  Therefore the
  updated information is available across multiple convention
  instances.  Not all of the conventions will necessarily use all of
  the information.
* Biographical Information Matrix

  The biographical information Matrix is made up of four different
  values.  They are the types of biographical information, the status
  of a biographical element, the destination for the biographical
  element, and the language that that element is written in.  There
  are limits applied to the various sizes of the entries, governed by
  the PublicationsLimits table.
** Types

   The (extendable) types that are currently in use are:
   + uri: The set of Uniform Resource Identifiers (URLs, URNs, etc)
     that are available on your Zambia site, for people to follow.
     Most HTML markup works with this type.  Examples include mailto
     references and webiste references.
   + bio: The written biographical descriptive information.
   + name: The name to be used in each circumstance
   + pronoun: The preferred pronoun.
   + twitter: A series of white-space separated twitter addresses.
   + facebook: A series of white-space separated Facebook addresses.
   + fetlife: A series of white-space separated FetLife addresses.
