Documentation/Bio_Editing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Bios Editing in Zambia</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Percy" />
<meta  name="description" content="Zambia is a piece of Conference Management Software.  This document is a &quot;How To&quot; guide to editing the various bios type entries for the Zambia FFF-branch instance for your conference.  This is still a work in progress."
 />
<meta  name="keywords" content="Zambia, Documentation, FFF branch" />
</head>
<body>
<div id="content">
<h1 class="title">Bios Editing in Zambia</h1>
<p>
Zambia is a piece of Conference Management Software.  This document is a "How To" guide to editing the various bios type entries for the Zambia FFF-branch instance for your conference.  This is still a work in progress.
</p>
<p>
Bios Editing in Zambia
</p>
<p>
Percy &lt;NELA.Percy@gmail.com&gt;
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Biographical Information Matrix</a>
<ul>
<li><a href="#sec-2-1">2.1. Types</a></li>
<li><a href="#sec-2-2">2.2. States</a></li>
<li><a href="#sec-2-3">2.3. Destinations</a></li>
<li><a href="#sec-2-4">2.4. Languages</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Pages</a>
<ul>
<li><a href="#sec-3-1">3.1. StaffManageBios.php</a></li>
<li><a href="#sec-3-2">3.2. StaffEditBios.php</a></li>
<li><a href="#sec-3-3">3.3. StaffEditCreateParticipant.php</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The biographical information for your presenters is an important
part of the convention experience that Zambia manages.  This is part
of how people decide they want to attend your convention and part of
what they might want to do when there.  From a presenter's point of
view, the biographical information is a way to connect with their
fan-base, to allow contact, give information, or arrange for
continued interactions.  From a con manager's point of view,
managing biographical information is fairly work-intensive, and one
of the things that doesn't exactly scale.
</p>

<p>
There are several pieces that make up the biographical information
matrix within Zambia.  Few, any, or all of the elements can be
chosen to be deployed and customized to the desire of your
particular convention or set of conventions.  Currently the
biographical information is designed to be held in a shared
database, which lies outside of a specific convention, so that,
while the information is available and editable within that
convention, when the information is updated, it is updated across
all the conventions served from the same server.  Therefore the
updated information is available across multiple convention
instances.  Not all of the conventions will necessarily use all of
the information.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Biographical Information Matrix</h2>
<div class="outline-text-2" id="text-2">
<p>
The biographical information Matrix is made up of four different
values.  They are the types of biographical information, the status
of a biographical element, the destination for the biographical
element, and the language that that element is written in.  There
are limits applied to the various sizes of the entries, governed by
the PublicationsLimits table.
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Types</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The (extendable) types that are currently in use are:
</p>
<ul class="org-ul">
<li>uri: The set of Uniform Resource Identifiers (URLs, URNs, etc)
that are available on your Zambia site, for people to follow.
Most HTML markup works with this type.  Examples include mailto
references and webiste references.
</li>
<li>bio: The written biographical descriptive information.
</li>
<li>name: The name to be used in each circumstance
</li>
<li>pronoun: The preferred pronoun.
</li>
<li>twitter: A series of white-space separated twitter addresses.
</li>
<li>facebook: A series of white-space separated Facebook addresses.
</li>
<li>fetlife: A series of white-space separated FetLife addresses.
</li>
</ul>
</div>
</div>
