Documentation/Source/Bio_Editing.tex
\documentclass[captions=tablesignature]{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{booktabs}
\usepackage[scaled]{beraserif}
\usepackage[scaled]{berasans}
\usepackage[scaled]{beramono}
\usepackage[usenames,dvipsnames]{color}
\usepackage{fancyhdr}
\usepackage{subfig}
\usepackage{listings}
\lstnewenvironment{common-lispcode}
{\lstset{language={HTML},basicstyle={\ttfamily\footnotesize},frame=single,breaklines=true}}
{}
\usepackage{paralist}
\let\itemize\compactitem
\let\description\compactdesc
\let\enumerate\compactenum
\usepackage[letterpaper,includeheadfoot,top=12.5mm,bottom=25mm,left=19mm,right=19mm]{geometry}
\pagestyle{fancy}
\setcounter{secnumdepth}{3}
\author{Percy\thanks{NELA.Percy@gmail.com}}
\date{November 2011}
\title{Bios Editing in Zambia}
\hypersetup{
  pdfkeywords={Zambia, Documentation, FFF branch},
  pdfsubject={Zambia is a piece of Conference Management Software.  This document is a "How To" guide to editing the various bios type entries for the Zambia FFF-branch instance for your conference.  This is still a work in progress.},
  pdfcreator={}}
\begin{document}

\maketitle
\pagenumbering{roman}
\thispagestyle{fancy}
\renewcommand{\headrulewidth}{0pt}
\renewcommand{\footrulewidth}{0pt}
\lhead{}
\rhead{}
\chead{}
\lfoot{}
\cfoot{}
\rfoot{}
\begin{abstract}
\vspace{5cm}
{\LARGE{\textbf{Abstract:\\}}}
Zambia is a piece of Conference Management Software.  This document is a "How To" guide to editing the various bios type entries for the Zambia FFF-branch instance for your conference.  This is still a work in progress.
\end{abstract}
\newpage
\renewcommand{\headrulewidth}{1pt}
\renewcommand{\footrulewidth}{1pt}
\chead{
Bios Editing in Zambia
}
\lfoot{
Percy <NELA.Percy@gmail.com>
}
\rfoot{\thepage}
\setcounter{tocdepth}{3}
\tableofcontents
\listoftables
\newpage
\pagenumbering{arabic}
\section{Introduction}
\label{sec-1}

The biographical information for your presenters is an important
part of the convention experience that Zambia manages.  This is part
of how people decide they want to attend your convention and part of
what they might want to do when there.  From a presenter's point of
view, the biographical information is a way to connect with their
fan-base, to allow contact, give information, or arrange for
continued interactions.  From a con manager's point of view,
managing biographical information is fairly work-intensive, and one
of the things that doesn't exactly scale.

There are several pieces that make up the biographical information
matrix within Zambia.  Few, any, or all of the elements can be
chosen to be deployed and customized to the desire of your
particular convention or set of conventions.  Currently the
biographical information is designed to be held in a shared
database, which lies outside of a specific convention, so that,
while the information is available and editable within that
convention, when the information is updated, it is updated across
all the conventions served from the same server.  Therefore the
updated information is available across multiple convention
instances.  Not all of the conventions will necessarily use all of
the information.

\section{Biographical Information Matrix}
\label{sec-2}

The biographical information Matrix is made up of four different
values.  They are the types of biographical information, the status
of a biographical element, the destination for the biographical
element, and the language that that element is written in.  There
are limits applied to the various sizes of the entries, governed by
the PublicationsLimits table.
\subsection{Types}
\label{sec-2-1}

The (extendable) types that are currently in use are:
\begin{itemize}
\item uri: The set of Uniform Resource Identifiers (URLs, URNs, etc)
that are available on your Zambia site, for people to follow.
Most HTML markup works with this type.  Examples include mailto
references and webiste references.
\item bio: The written biographical descriptive information.
\item name: The name to be used in each circumstance
\item pronoun: The preferred pronoun.
\item twitter: A series of white-space separated twitter addresses.
\item facebook: A series of white-space separated Facebook addresses.
\item fetlife: A series of white-space separated FetLife addresses.
\end{itemize}
