Documentation/Bio_Editing.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> States</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The states that are currently in use are used as a flow for the
information and communication around such.
</p>
<ul class="org-ul">
<li>raw: This is the information provided by or updated by the
presenter when they have been granted access to Zambia.  They
might update this, and that will show as differences between this
state and the "edited" state and/or the "good" state.  This
allows for unknown people to put unknown references and
information on your web-site.  Beware.
</li>
<li>edited: This is intended to be the mid-step, the negotiation
point between the people responsible for what is being published
in the literature and on the web, and the individual presenters,
it is presented to facilitate dialogue, and everyone can see how
it is to be presented, should it be approved.  Once the "edited"
state and the "raw" state are in agreement due to the
collaboration between the staff and the participant, it would be
considered ready for promotion to the "good" state.
</li>
<li>good: This is what is slated to be published.  Once the "edited"
state information matches the "raw" state information, that bio
element should be promoted to the "good" state. If further
changes to the "raw" state information happen, because a
participant has edited the information, the process begins again.
various publishing media.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Destinations</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The possible destinations for each of the types, determines where
that particular information is going to be used.  Each of the
limits set in the PublicationLimits table is both Type and
Destination keyed, so, for example, the limit for the information
published on the web might be more verbose (or in a different
format) than that published on the badge, or in the con hard copy
publications.
</p>
<ul class="org-ul">
<li>web: To be published on the web, on the larger website, and in
the KonOpas subset, if that is chosen to be used.
</li>
<li>book: To be published in a hard copy format, a book, a pamphlet,
or the like about the con.
</li>
<li>badge: To be published on a name-badge type object, so that a
subset of the information is immediately available at a glance.
</li>
<li>staffweb: As for the web, but for staff bios, which might be
different from present or vending bios.
</li>
<li>staffbook: Similar to staffweb, for the staff bios which might be
different from presenting or vending bios.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Languages</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The language field is designed to contain any of the various
language elements.  Currently en-us and fr-ca are the two expected
ones, as a hold-over from the original "secondary language" concept
of Zambia when it was used for a Canadian event.  Starting any
language will allow it to be flexible enough to have it show up in
the appropriate tables.  Just adding to the LANGUAGE_LIST searches
for each/all of the languages listed.  While this is a first step
in the internationalization of this software, expanding the rest,
along these lines is expected and planned for.  Each of the other
elements, the various verbiage on the pages, and in the reports
will pull from similar tables, able to be customized off of, or
feed concurrently, depending on the design the multiple languages
available.  All of the biographical information is designed to be
subsequently displayed, rather than switched on the
$_SESSION['language'] variable.
</p>
</div>
</div>
</div>
