Documentation/Bio_Editing.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Pages</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> StaffManageBios.php</h3>
<div class="outline-text-3" id="text-3-1">
<A NAME="StaffManageBios.php" ID="StaffManageBios.php"></A>
<p>
<a href="../webpages/StaffManageBios.php">StaffManageBios.php</a>
</p>
<p>
This is the starting point for managing the biographical and
descriptive information data that will be published.  The specific
grids are:
</p>
<ul class="org-ul">
<li>the presenters
</li>
<li>the staff
</li>
<li>the schedule elements
</li>
<li>the volunteers
</li>
<li>the vendors
</li>
</ul>

<p>
Each of the tables on this page (illustrated below) address
different sets of information.  There might be some overlap, for
example a staff member might also be a vendor, or a presenter, so
information might be accessible via several paths.  Every table
cell will allow you to click through, and address whatever
biographical elements need updating.
</p>

<p>
The rows are organized around the states with the first three rows
indicating missing entries for the "raw" state the would appear in
the first row, or missing elements in the "edited" state or "good"
state that exist in the "raw" state in the second and third.  The
fourth through sixth rows are comparisons to find which elements
don't match.  The fourth row being if the "raw" state elements and
the "edited" state elements don't match. The fifth a comparison
between the "raw" state and "good" state.  The sixth being between
the "edited" state and the "good" state. Then, the final row is for
if everything across all the states match each other.  The goal is
to achieve everything listed in the final row.
</p>

<p>
The columns are a combination of the various languages available
and the types and destinations of each element.
</p>

<p>
To bring up the list of individuals in any particular category of
missing, incorrect, or even correct information, simply click on
the number of elements in the state you wish to work with.  In the
example below, there are seven individuals who do not have an
edited en-us web entry in the biographical information matrix.  By
clicking on the "7" in that section of the table, you bring up the
list of participants who's elements need editing.
</p>

<p>
The table might resemble the following:
</p>
<table id="tbl:staffmanageparticipantbiographies" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption align="above"><span class="table-number">Table 1:</span> Staff - Manage Participant Biographies</caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Count of the States of the bios</th>
<th scope="col" class="right">en-us name web</th>
<th scope="col" class="right">fr-ca name web</th>
<th scope="col" class="right">en-us name book</th>
<th scope="col" class="right">fr-ca name book</th>
<th scope="col" class="right">en-us web uri</th>
<th scope="col" class="right">fr-ca web uri</th>
<th scope="col" class="right">en-us book uri</th>
<th scope="col" class="right">fr-ca book uri</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Missing raw bio</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">3</td>
<td class="right">6</td>
<td class="right">59</td>
<td class="right">61</td>
<td class="right">14</td>
<td class="right">61</td>
</tr>

<tr>
<td class="left">Missing edited bio</td>
<td class="right">7</td>
<td class="right">16</td>
<td class="right">21</td>
<td class="right">5</td>
<td class="right">48</td>
<td class="right">61</td>
<td class="right">14</td>
<td class="right">61</td>
</tr>

<tr>
<td class="left">Missing good bio</td>
<td class="right">59</td>
<td class="right">59</td>
<td class="right">59</td>
<td class="right">59</td>
<td class="right">59</td>
<td class="right">61</td>
<td class="right">14</td>
<td class="right">61</td>
</tr>

<tr>
<td class="left">Raw bio doesn't match edited bio</td>
<td class="right">17</td>
<td class="right">11</td>
<td class="right">18</td>
<td class="right">19</td>
<td class="right">9</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="left">Edited bio doesn't match good bio</td>
<td class="right">12</td>
<td class="right">9</td>
<td class="right">28</td>
<td class="right">46</td>
<td class="right">9</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="left">All bios match</td>
<td class="right">5</td>
<td class="right">3</td>
<td class="right">4</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">61</td>
<td class="right">47</td>
<td class="right">61</td>
</tr>
</tbody>
</table>

<p>
Once the particular subsection for editing has been picked, you
will be provided with a list of names in this category, so you
might choose the one(s) to be edited.  Illustrated below.
</p>

<p>
The three columns in this table are:
</p>
<ul class="org-ul">
<li>Participant: Each name in this column is a link that will bring
you to the page referenced by section <a href="#sec-3-2">3.2</a> for the
individual chosen, so the "edited" state can be updated.  Also
from here is where the information might be promoted to the
"good" state if everything is in agreement.
</li>
<li>Edit Full: Each name in this column is a link that will bring you
to the page referenced by section <a href="#sec-3-3">3.3</a>
to edit the "raw" state of the information on the participant
chosen. This is the full information we have on an individual, in
case that such information is necessary to find out more about
who they are, or if there are any notes, or the like to assist
you with the biographical information editing.
</li>
<li>Currently being edited by: This column indicates the individual
who is the one editing the particular individual's information at
this time.  Please, do not choose to edit the biographical
information of someone who is locked by someone other than you.
</li>
</ul>

<p>
The table might resemble the following:
</p>
<table id="tbl:staffmanageparticipantbiographiessubedit" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption align="above"><span class="table-number">Table 2:</span> Staff - Manage Participant Biographies Subedit</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Participant</th>
<th scope="col" class="left">Edit Full</th>
<th scope="col" class="left">Currently being edited by</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Mr E.</td>
<td class="left">Mr E.</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Joker</td>
<td class="left">Joker</td>
<td class="left">Str8mn</td>
</tr>

<tr>
<td class="left">Batman</td>
<td class="left">Batman</td>
<td class="left">The Riddler</td>
</tr>

<tr>
<td class="left">The Riddler</td>
<td class="left">The Riddler</td>
<td class="left">Batman</td>
</tr>

<tr>
<td class="left">Catwoman</td>
<td class="left">Catwoman</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Cartman</td>
<td class="left">Cartman</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Robin</td>
<td class="left">Robin</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
There is also the "return" link, just above the table, that brings
you back to the page referenced by the table <a href="#tbl:staffmanageparticipantbiographies">"Staff - Manage
Participant Biographies"</a>, in case you are done with this particular
subset of individuals, and wish to deal with others.
</p>
</div>
</div>
