Documentation/Source/Bio_Editing.tex

\section{Pages}
\label{sec-3}
\subsection{StaffManageBios.php}
\label{sec-3-1}
\label{StaffManageBios.php}
\underline{
\href{../webpages/StaffManageBios.php}{StaffManageBios.php}
}

This is the starting point for managing the biographical and
descriptive information data that will be published.  The specific
grids are:
\begin{itemize}
\item the presenters
\item the staff
\item the schedule elements
\item the volunteers
\item the vendors
\end{itemize}

Each of the tables on this page (illustrated below) address
different sets of information.  There might be some overlap, for
example a staff member might also be a vendor, or a presenter, so
information might be accessible via several paths.  Every table
cell will allow you to click through, and address whatever
biographical elements need updating.

The rows are organized around the states with the first three rows
indicating missing entries for the "raw" state the would appear in
the first row, or missing elements in the "edited" state or "good"
state that exist in the "raw" state in the second and third.  The
fourth through sixth rows are comparisons to find which elements
don't match.  The fourth row being if the "raw" state elements and
the "edited" state elements don't match. The fifth a comparison
between the "raw" state and "good" state.  The sixth being between
the "edited" state and the "good" state. Then, the final row is for
if everything across all the states match each other.  The goal is
to achieve everything listed in the final row.

The columns are a combination of the various languages available
and the types and destinations of each element.

To bring up the list of individuals in any particular category of
missing, incorrect, or even correct information, simply click on
the number of elements in the state you wish to work with.  In the
example below, there are seven individuals who do not have an
edited en-us web entry in the biographical information matrix.  By
clicking on the "7" in that section of the table, you bring up the
list of participants who's elements need editing.

The table might resemble the following:
\begin{table}[htb]
\caption{\label{tbl:staffmanageparticipantbiographies}Staff - Manage Participant Biographies}
\centering
\begin{tabular}{lrrrrrrrr}
\hline
Count of the States of the bios & en-us name web & fr-ca name web & en-us name book & fr-ca name book & en-us web uri & fr-ca web uri & en-us book uri & fr-ca book uri\\
\hline
Missing raw bio &  &  & 3 & 6 & 59 & 61 & 14 & 61\\
Missing edited bio & 7 & 16 & 21 & 5 & 48 & 61 & 14 & 61\\
Missing good bio & 59 & 59 & 59 & 59 & 59 & 61 & 14 & 61\\
Raw bio doesn't match edited bio & 17 & 11 & 18 & 19 & 9 &  &  & \\
Edited bio doesn't match good bio & 12 & 9 & 28 & 46 & 9 &  &  & \\
All bios match & 5 & 3 & 4 &  &  & 61 & 47 & 61\\
\hline
\end{tabular}
\end{table}

Once the particular subsection for editing has been picked, you
will be provided with a list of names in this category, so you
might choose the one(s) to be edited.  Illustrated below.

The three columns in this table are:
\begin{itemize}
\item Participant: Each name in this column is a link that will bring
you to the page referenced by section \ref{sec-3-2} for the
individual chosen, so the "edited" state can be updated.  Also
from here is where the information might be promoted to the
"good" state if everything is in agreement.
\item Edit Full: Each name in this column is a link that will bring you
to the page referenced by section \ref{sec-3-3}
to edit the "raw" state of the information on the participant
chosen. This is the full information we have on an individual, in
case that such information is necessary to find out more about
who they are, or if there are any notes, or the like to assist
you with the biographical information editing.
\item Currently being edited by: This column indicates the individual
who is the one editing the particular individual's information at
this time.  Please, do not choose to edit the biographical
information of someone who is locked by someone other than you.
\end{itemize}

The table might resemble the following:
\begin{table}[htb]
\caption{\label{tbl:staffmanageparticipantbiographiessubedit}Staff - Manage Participant Biographies Subedit}
\centering
\begin{tabular}{lll}
\hline
Participant & Edit Full & Currently being edited by\\
\hline
Mr E. & Mr E. & \\
Joker & Joker & Str8mn\\
Batman & Batman & The Riddler\\
The Riddler & The Riddler & Batman\\
Catwoman & Catwoman & \\
Cartman & Cartman & \\
Robin & Robin & \\
\hline
\end{tabular}
\end{table}

There is also the "return" link, just above the table, that brings
you back to the page referenced by the table \hyperref[tbl:staffmanageparticipantbiographies]{"Staff - Manage
Participant Biographies"}, in case you are done with this particular
subset of individuals, and wish to deal with others.
