Documentation/Source/Bio_Editing.org
** StaffEditBios.php
#+LaTeX: \label{StaffEditBios.php}
#+HTML: <A NAME="StaffEditBios.php" ID="StaffEditBios.php"></A>
#+LaTeX: \underline{
   [[../webpages/StaffEditBios.php][StaffEditBios.php]]
#+LaTex: }

   This page is where an individual's information is edited from the
   point of view of the con staff.  Once this page is opened for a
   participant, the editing individual's name will be placed in the
   "Currently being edited by" column, so two people don't try to edit
   the same bio information at the same time.

   There are two links at the top of the page.  The first is the
   individuals name and will lead you to the page mentioned section
   [[StaffEditCreateParticipant.php]], in the mode of editing the
   participant chosen, and the return link, which will bring you back
   to the table above on the page from section [[StaffManageBios.php]].

   Any of the "Save Whole Page" buttons will save the current state of
   the entire page, and clear the "Currently being edited by" flag.

   The "Promote ... to good." links will only show up if the "raw"
   state information matches the "edited" state information.

   The "Good entry exists for ... Biography" informational statement
   is there to let you know that the information has been promoted all
   the way up to the "good" state at least once before.

   The design of this page has a series of elements, alternating "raw"
   state and "edited" state boxes, with the "raw" state boxes there
   for copying purposes, for they are not malleable.  Which entries
   are available are dependent on what access the individual has.  The
   ordering of the elements on the page will be something like:
   + raw uri book en-us
   + edited uri book en-us
   + raw uri book fr-ca
   + edited uri book fr-ca
   + raw uri web en-us
   + edited uri web en-us
   + raw uri web fr-ca
   + edited uri web fr-ca
   + raw bio book en-us
   + edited bio book en-us
   + ...

   There might be style guide for the formatting of the information in
   each of the informational entries.  Things like:
   - Each of the web and book bios entries are pre-pended
     automatically with the web and book name entries, bios should be
     written in the third person, and start with a space character.
   - Multi-entry web uri entries should be separated by a web-style
     line-break.
   - Multi-entry book uri entries should be separated by a
     double-colon

   The database is (by default) a Latin-8 character set, so anything
   in the entries that is outside of that character set, will, most
   probably either be replaced by "?" or break the entry.

   Entries into the blocks can be as long as you like, but, they will
   be length-checked, and rejected if they are longer than the limits
   set by the PublicationLimits table.
** StaffEditCreateParticipant.php
#+LaTeX: \label{StaffEditCreateParticipant.php}
#+HTML: <A NAME="StaffEditCreateParticipant.php" ID="StaffEditCreateParticipant.php"></A>
#+LaTeX: \underline{
   [[../webpages/StaffEditCreateParticipant.php?action=edit][StaffEditCreateParticipant.php]]
#+LaTex: }

   While this page is of more general use (which is more fully
   documented in the Presenter Flow Document) if absolutely necessary
   it can be used to modify the raw biographical information. The raw
   state of all of the types (uri, facebook, bio, etc.), destinations
   (web, book, badge, etc.), and languages are available to be edited
   on this page.
