Documentation/Bio_Editing.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> StaffEditBios.php</h3>
<div class="outline-text-3" id="text-3-2">
<A NAME="StaffEditBios.php" ID="StaffEditBios.php"></A>
<p>
<a href="../webpages/StaffEditBios.php">StaffEditBios.php</a>
</p>
<p>
This page is where an individual's information is edited from the
point of view of the con staff.  Once this page is opened for a
participant, the editing individual's name will be placed in the
"Currently being edited by" column, so two people don't try to edit
the same bio information at the same time.
</p>

<p>
There are two links at the top of the page.  The first is the
individuals name and will lead you to the page mentioned section
<a href="#sec-3-3">3.3</a>, in the mode of editing the
participant chosen, and the return link, which will bring you back
to the table above on the page from section <a href="#sec-3-1">3.1</a>.
</p>

<p>
Any of the "Save Whole Page" buttons will save the current state of
the entire page, and clear the "Currently being edited by" flag.
</p>

<p>
The "Promote &#x2026; to good." links will only show up if the "raw"
state information matches the "edited" state information.
</p>

<p>
The "Good entry exists for &#x2026; Biography" informational statement
is there to let you know that the information has been promoted all
the way up to the "good" state at least once before.
</p>

<p>
The design of this page has a series of elements, alternating "raw"
state and "edited" state boxes, with the "raw" state boxes there
for copying purposes, for they are not malleable.  Which entries
are available are dependent on what access the individual has.  The
ordering of the elements on the page will be something like:
</p>
<ul class="org-ul">
<li>raw uri book en-us
</li>
<li>edited uri book en-us
</li>
<li>raw uri book fr-ca
</li>
<li>edited uri book fr-ca
</li>
<li>raw uri web en-us
</li>
<li>edited uri web en-us
</li>
<li>raw uri web fr-ca
</li>
<li>edited uri web fr-ca
</li>
<li>raw bio book en-us
</li>
<li>edited bio book en-us
</li>
<li>&#x2026;
</li>
</ul>

<p>
There might be style guide for the formatting of the information in
each of the informational entries.  Things like:
</p>
<ul class="org-ul">
<li>Each of the web and book bios entries are pre-pended
automatically with the web and book name entries, bios should be
written in the third person, and start with a space character.
</li>
<li>Multi-entry web uri entries should be separated by a web-style
line-break.
</li>
<li>Multi-entry book uri entries should be separated by a
double-colon
</li>
</ul>

<p>
The database is (by default) a Latin-8 character set, so anything
in the entries that is outside of that character set, will, most
probably either be replaced by "?" or break the entry.
</p>

<p>
Entries into the blocks can be as long as you like, but, they will
be length-checked, and rejected if they are longer than the limits
set by the PublicationLimits table.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> StaffEditCreateParticipant.php</h3>
<div class="outline-text-3" id="text-3-3">
<A NAME="StaffEditCreateParticipant.php" ID="StaffEditCreateParticipant.php"></A>
<p>
<a href="../webpages/StaffEditCreateParticipant.php?action=edit">StaffEditCreateParticipant.php</a>
</p>
<p>
While this page is of more general use (which is more fully
documented in the Presenter Flow Document) if absolutely necessary
it can be used to modify the raw biographical information. The raw
state of all of the types (uri, facebook, bio, etc.), destinations
(web, book, badge, etc.), and languages are available to be edited
on this page.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: November 2011</p>
<p class="author">Author: Percy</p>
<p class="email">Email: <a href="mailto:NELA.Percy@gmail.com">NELA.Percy@gmail.com</a></p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>