Documentation/Source/Bio_Editing.tex

\subsection{StaffEditBios.php}
\label{sec-3-2}
\label{StaffEditBios.php}
\underline{
\href{../webpages/StaffEditBios.php}{StaffEditBios.php}
}

This page is where an individual's information is edited from the
point of view of the con staff.  Once this page is opened for a
participant, the editing individual's name will be placed in the
"Currently being edited by" column, so two people don't try to edit
the same bio information at the same time.

There are two links at the top of the page.  The first is the
individuals name and will lead you to the page mentioned section
\ref{sec-3-3}, in the mode of editing the
participant chosen, and the return link, which will bring you back
to the table above on the page from section \ref{sec-3-1}.

Any of the "Save Whole Page" buttons will save the current state of
the entire page, and clear the "Currently being edited by" flag.

The "Promote \ldots{} to good." links will only show up if the "raw"
state information matches the "edited" state information.

The "Good entry exists for \ldots{} Biography" informational statement
is there to let you know that the information has been promoted all
the way up to the "good" state at least once before.

The design of this page has a series of elements, alternating "raw"
state and "edited" state boxes, with the "raw" state boxes there
for copying purposes, for they are not malleable.  Which entries
are available are dependent on what access the individual has.  The
ordering of the elements on the page will be something like:
\begin{itemize}
\item raw uri book en-us
\item edited uri book en-us
\item raw uri book fr-ca
\item edited uri book fr-ca
\item raw uri web en-us
\item edited uri web en-us
\item raw uri web fr-ca
\item edited uri web fr-ca
\item raw bio book en-us
\item edited bio book en-us
\item \ldots{}
\end{itemize}

There might be style guide for the formatting of the information in
each of the informational entries.  Things like:
\begin{itemize}
\item Each of the web and book bios entries are pre-pended
automatically with the web and book name entries, bios should be
written in the third person, and start with a space character.
\item Multi-entry web uri entries should be separated by a web-style
line-break.
\item Multi-entry book uri entries should be separated by a
double-colon
\end{itemize}

The database is (by default) a Latin-8 character set, so anything
in the entries that is outside of that character set, will, most
probably either be replaced by "?" or break the entry.

Entries into the blocks can be as long as you like, but, they will
be length-checked, and rejected if they are longer than the limits
set by the PublicationLimits table.

\subsection{StaffEditCreateParticipant.php}
\label{sec-3-3}
\label{StaffEditCreateParticipant.php}
\underline{
\href{../webpages/StaffEditCreateParticipant.php?action=edit}{StaffEditCreateParticipant.php}
}

While this page is of more general use (which is more fully
documented in the Presenter Flow Document) if absolutely necessary
it can be used to modify the raw biographical information. The raw
state of all of the types (uri, facebook, bio, etc.), destinations
(web, book, badge, etc.), and languages are available to be edited
on this page.
\end{document}